#Практична робота №4 Рукасов Владислав 
# Дані студентів: [Прізвище, Інформатика, Вища матем., Фізика, Програмування]
students = [
    ["Іванчук С.О.", 4, 3, 3, 4],
    ["Панченко І.А.", 5, 4, 4, 5],
    ["Заєць О.М.", 3, 4, 4, 4],
    ["Вельбицький П.О.", 4, 3, 3, 3],
    ["Сидоренко В.Р.", 2, 3, 3, 2],
    ["Кравченко З.І.", 3, 5, 4, 5],
    ["Якубів Р.Н.", 5, 4, 4, 3],
    ["Зоренко П.М.", 4, 2, 3, 3],
    ["Берестяк Г.С.", 4, 5, 5, 5],
    ["Дячик Н.С.", 5, 5, 4, 4]
]

print("Студенти із середнім балом менше 4:\n")
print(f"{'№':<3} {'Прізвище та ініціали':<20} {'Інф.':<5} {'Вища мат.':<10} {'Фізика':<8} {'Програм.':<10} {'Сер. бал':<8}")
print("-" * 75)

# Обробка даних
for i, s in enumerate(students, start=1):
    avg = (s[1] + s[2] + s[3] + s[4]) / 4
    if avg < 4:
        print(f"{i:<3} {s[0]:<20} {s[1]:<5} {s[2]:<10} {s[3]:<8} {s[4]:<10} {avg:<8.2f}")
